Рабочая.Задачи2/src/InformationRegisters/ЦБР_СтартОтказОтЗадач/ЦБР_СтартОтказОтЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦБР_СтартОтказОтЗадач</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ПринятоВРаботу</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ПричинаОтказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.ЦБР_Задача</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Рабочая.Задачи2/src/InformationRegisters/ЦБР_УточненияПоЗадачамЗаданиям/ЦБР_УточненияПоЗадачамЗаданиям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦБР_УточненияПоЗадачамЗаданиям</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекстОтвета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтветаНаЗапросФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаОтветаНаЗапрос</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДатаОтветаНаЗапрос</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DocumentRef.ЦБР_Задание</types>
      <types>CatalogRef.ЦБР_Задача</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заявитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответчик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Рабочая.Задачи2/src/Enums/ЦБР_РольВЗадаче/ЦБР_РольВЗадаче.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЦБР_РольВЗадаче</name>
  <enumValues>
    <name>Постановщик</name>
  </enumValues>
  <enumValues>
    <name>Наблюдатель</name>
  </enumValues>
  <enumValues>
    <name>Исполнитель</name>
  </enumValues>
  <enumValues>
    <name>КураторИсполнителя</name>
  </enumValues>
  <enumValues>
    <name>КураторПостановщика</name>
  </enumValues>
  <enumValues>
    <name>ВладелецЗадачи</name>
  </enumValues>
  <enumValues>
    <name>ИсполнительРазработчик</name>
  </enumValues>
  <enumValues>
    <name>ИсполнительАналитик</name>
  </enumValues>
</mdclass:Enum>

Рабочая.Задачи2/src/Enums/ЦБР_Состояние/ЦБР_Состояние.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЦБР_Состояние</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>ГотовКСдаче</name>
  </enumValues>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>ЗапросИнформации</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>НаТестировании</name>
  </enumValues>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
  <enumValues>
    <name>ПринятьЗадачу</name>
  </enumValues>
  <enumValues>
    <name>Приостановлен</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>УточнениеТребований</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

Рабочая.Задачи2/src/Enums/ЦБР_ТипОценкиЗадачи/ЦБР_ТипОценкиЗадачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЦБР_ТипОценкиЗадачи</name>
  <enumValues>
    <name>ПоФакту</name>
  </enumValues>
  <enumValues>
    <name>Предсогласованные</name>
  </enumValues>
  <enumValues>
    <name>Стандартная</name>
  </enumValues>
</mdclass:Enum>

Рабочая.Задачи2/src/Documents/ЦБР_Задание/ЦБР_Задание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЦБР_Задание</name>
  <registerRecords>AccumulationRegister.ЦБР_ЧасыКлиентов</registerRecords>
  <registerRecords>AccumulationRegister.ЦБР_СогласованоЗакрытоЧасов</registerRecords>
  <registerRecords>AccumulationRegister.ЦБР_КоличествоЧасовСотрудниковПоЗадачам</registerRecords>
  <attributes>
    <name>Аналитик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЧаса</name>
    <type>
      <types>EnumRef.ЦБР_ВидыЧасовПоЗадачам</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалоПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалоФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончаниеПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончаниеФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьДниПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьДниФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПереписка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПрикрепленныйФайл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаСчетКомпании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КоментарийКСогласованию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОценки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьСроки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НетГарантииОценки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаданияВУровне</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДополнительное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаПоФакту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущееЗадание</name>
    <type>
      <types>DocumentRef.ЦБР_Задание</types>
    </type>
  </attributes>
  <attributes>
    <name>Принято</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Разделена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РамочнаяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.ЦБР_СтруктураЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаЗадачу</name>
    <type>
      <types>CatalogRef.ЦБР_Задача</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаСтруктуру</name>
    <type>
      <types>CatalogRef.ЦБР_СтруктураЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОценкиЗадачи</name>
    <type>
      <types>EnumRef.ЦБР_ТипОценкиЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПланДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПланОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПланПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалосьРешитьПриПодключении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификаторЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧасыСогласованы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоУточнениеТребований</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПланСтарый</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Предшественники</name>
    <attributes>
      <name>Предшественник</name>
      <type>
        <types>DocumentRef.ЦБР_Задание</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗависимости</name>
      <type>
        <types>EnumRef.ЦБР_ТипЗависимостиЗаданий</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭффективныеЧасы</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЧаса</name>
      <type>
        <types>EnumRef.ЦБР_ВидыЧасовПоЗадачам</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭффективныеЧасы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействиеКалендаря</name>
      <type>
        <types>CatalogRef.ЦБР_ЗаписиРабочегоКалендаря</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧасыЗП</name>
    <attributes>
      <name>ПериодЗП</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭффективныеЧасы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЧаса</name>
      <type>
        <types>EnumRef.ЦБР_ВидыЧасовПоЗадачам</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.cbr_РеализацияТоваровУслугУПР</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаСчетКомпании</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Зачтено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Рабочая.Задачи2/src/CommonModules/ЦБР_ВидимостьДоступностьЭлементовФормы/Module.bsl
#Область СлужебныеПроцедурыИФункции

Процедура УстановитьВидимостьТолькоПросмотрУЭлементовФормы(ЭтотОбъект) Экспорт

	Элементы 	= ЭтотОбъект.Элементы; 
	Объект		= ЭтотОбъект.Объект;
	
	СостояниеЗадачи = ЦБР_СтатусыОбъектовПолныеПрава.ПолучитьАктуальныйСтатусЗадачиПользователя(Объект.Ссылка, Пользователи.АвторизованныйПользователь());
	
	СрезПоследних = РегистрыСведений.ЦБР_СтартОтказОтЗадач.СрезПоследних(ТекущаяДатаСеанса(),Новый Структура("Задача", Объект.Ссылка));
	
	Если ЗначениеЗаполнено(СрезПоследних) Тогда
		Стартовала = СрезПоследних[0].ПринятоВРаботу;
	Иначе
		Стартовала = Ложь;
	КонецЕсли;

	Если Объект.Ссылка.Пустая() Тогда
		Для Каждого Страница Из Элементы.Страницы.ПодчиненныеЭлементы Цикл
			Если Страница.Имя <> "СтраницаРеквизиты" Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, Страница.Имя, "Видимость", Ложь);
			КонецЕсли;
		КонецЦикла;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Страницы", "ОтображениеСтраниц",
		ОтображениеСтраницФормы.Нет);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СменитьПостановщика", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаКомандыЗадачи", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаЗакрытьЗадачу", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаРеанимировать", "Видимость", Ложь); 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаСогласоватьВсеЭтапы", "Видимость", Ложь); 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаПрикрепитьРеализации", "Видимость", Ложь);
		Возврат;
	КонецЕсли;

#Область РольТекущегоПользователя
	МассивРолей = ПолучитьРолиВЗадачиУТекущегоПользователя(Объект, Пользователи.ТекущийПользователь());

	яНаблюдатель 				= Ложь;

	Если Объект.Постановщик = Пользователи.ТекущийПользователь() Тогда
		яПостановщик				= Истина;
	Иначе
		яПостановщик				= Ложь;
	КонецЕсли;

	Если Объект.Куратор = Пользователи.ТекущийПользователь() Тогда
		яКуратор				= Истина;
	Иначе
		яКуратор				= Ложь;
	КонецЕсли;
	яРуководительПостановщика	= Ложь;

	яИсполнитель				= Ложь;
	яАналитик					= Ложь;
	яРуководительИсполнителя	= Ложь;
	яВладелецЗадачи				= Ложь;

	Если МассивРолей = Неопределено Тогда
		яНаблюдатель = Истина;
	Иначе
		Для Каждого Строка Из МассивРолей Цикл
			Если Строка = Перечисления.ЦБР_РольВЗадаче.Постановщик Тогда
				яПостановщик = Истина;
			ИначеЕсли Строка = Перечисления.ЦБР_РольВЗадаче.КураторПостановщика Тогда
				яРуководительПостановщика = Истина;
			ИначеЕсли Строка = Перечисления.ЦБР_РольВЗадаче.Исполнитель
				ИЛИ Строка = Перечисления.ЦБР_РольВЗадаче.ИсполнительРазработчик
				ИЛИ Строка = Перечисления.ЦБР_РольВЗадаче.ИсполнительАналитик Тогда
				яИсполнитель = Истина;
			ИначеЕсли Строка = Перечисления.ЦБР_РольВЗадаче.КураторИсполнителя Тогда
				яРуководительИсполнителя = Истина;
			ИначеЕсли Строка = Перечисления.ЦБР_РольВЗадаче.ВладелецЗадачи Тогда
				яВладелецЗадачи = Истина;
			КонецЕсли;

		КонецЦикла;
	КонецЕсли;
#КонецОбласти

		ЭтотОбъект.ТолькоПросмотр = Ложь;
		Элементы.ОписаниеЗадачи.ТолькоПросмотр = Ложь;
		Элементы.КоманднаяПанельОписание.ТолькоПросмотр = Ложь;
		Элементы.ГруппаКонфигурации.ТолькоПросмотр = Ложь;

	Если яНаблюдатель Тогда
		//@skip-check module-self-reference
		ЭтотОбъект.ТолькоПросмотр = Истина;
		Элементы.ОписаниеЗадачи.ТолькоПросмотр = Истина;
		Элементы.КоманднаяПанельОписание.ТолькоПросмотр = Истина;
		Элементы.ГруппаКонфигурации.ТолькоПросмотр = Истина;
	КонецЕсли;

	Если яПостановщик ИЛИ яРуководительПостановщика ИЛИ яНаблюдатель Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаГруппа2", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаДобавитьСобытиеПоЗадаче", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоКоманднаяПанель", "Видимость", Ложь); 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийКоманднаяПанель", "Видимость", Ложь); 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийКонтекстноеМеню", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "группаИзмененияСтрок", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "группаЧасыСроки", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийЗапланироватьВзаимодействие", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоКонтекстноеМеню", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаРеквизиты", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаКоманда", "Видимость", Ложь);
	Иначе				
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаГруппа2", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаГруппа3", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаКнопокЗапросИнформации", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийКоманднаяПанель", "Видимость", Истина); 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийКонтекстноеМеню", "Видимость", Истина); 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоКонтекстноеМеню", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "группаИзмененияСтрок", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "группаЧасыСроки", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийЗапланироватьВзаимодействие", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоКонтекстноеМеню", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаРеквизиты", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаКоманда", "Видимость", Ложь); 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаПрикрепитьРеализации", "Видимость", Ложь);
	КонецЕсли; 
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаЗакрытьЗадачу", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаРеанимировать", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаСогласоватьВсеЭтапы", "Видимость", Ложь);
	
	Если яРуководительПостановщика Тогда
	   ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийОтменитьСогласованныйЭтап", "Видимость", Истина);
	КонецЕсли;
			
#Область ВидимостьПоСостояниям
	Если СостояниеЗадачи = Перечисления.ЦБР_Состояние.Черновик Тогда

		Для Каждого Страница Из Элементы.Страницы.ПодчиненныеЭлементы Цикл
			Если Страница.Имя <> "СтраницаРеквизиты" Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, Страница.Имя, "Видимость", Ложь);
			КонецЕсли;
		КонецЦикла;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Страницы", "ОтображениеСтраниц",
			ОтображениеСтраницФормы.Нет);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СменитьПостановщика", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаКомандыЗадачи", "Видимость", Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаРеквизиты", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаКоманда", "Видимость", Истина);
				
		Если Не яПостановщик И Не яРуководительПостановщика Тогда
			//@skip-check module-self-reference
			ЭтотОбъект.ТолькоПросмотр = Истина;
			Элементы.ОписаниеЗадачи.ТолькоПросмотр = Истина;
			Элементы.КоманднаяПанельОписание.ТолькоПросмотр = Истина;
			Элементы.ГруппаКонфигурации.ТолькоПросмотр = Истина;
		КонецЕсли;

	ИначеЕсли СостояниеЗадачи = Перечисления.ЦБР_Состояние.Новый Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаКомандыЗадачи", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийКоманднаяПанель", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийПересогласоватьЭтап", "Видимость", Истина);
		
		Если Не Стартовала Тогда
			Для Каждого Страница Из Элементы.Страницы.ПодчиненныеЭлементы Цикл
				Если Страница.Имя <> "СтраницаОбзор" Тогда
					ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, Страница.Имя, "Видимость",
						Ложь);
				КонецЕсли;
			КонецЦикла;
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Страницы", "ОтображениеСтраниц", ОтображениеСтраницФормы.Нет);

			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаГруппа2", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаГруппа3", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаКнопокЗапросИнформации", "Видимость", Ложь);
		Иначе
			Для Каждого Страница Из Элементы.Страницы.ПодчиненныеЭлементы Цикл
				Если Страница.Имя <> "СтраницаОбзор" И Страница.Имя <> "ПланЗадачи" Тогда
					ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, Страница.Имя, "Видимость", Ложь);
				ИНаче
					ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, Страница.Имя, "Видимость", Истина);
				КонецЕсли;
			КонецЦикла;
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Страницы", "ОтображениеСтраниц", ОтображениеСтраницФормы.ЗакладкиСверху);
			//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗадачГруппаФакт", "Видимость", Ложь);
						
		КонецЕсли;
		
		Если яКуратор Или яВладелецЗадачи Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПервая", "Видимость", Истина);
		КонецЕсли;
		
	ИначеЕсли СостояниеЗадачи = Перечисления.ЦБР_Состояние.НаСогласовании Тогда
		
		Если яПостановщик ИЛИ яРуководительПостановщика Тогда 
             ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаСогласоватьВсеЭтапы", "Видимость", Истина);
		КонецЕсли;	

	ИначеЕсли СостояниеЗадачи = Перечисления.ЦБР_Состояние.ВРаботе Тогда

	ИначеЕсли СостояниеЗадачи = Перечисления.ЦБР_Состояние.Выполнен Или СостояниеЗадачи = Перечисления.ЦБР_Состояние.Закрыт Тогда
		ЭтотОбъект.ТолькоПросмотр = Истина;
		Элементы.ОписаниеЗадачи.ТолькоПросмотр = Истина;
		Элементы.ГруппаКонфигурации.ТолькоПросмотр = Истина;
		Если яПостановщик ИЛИ яРуководительПостановщика Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаЗакрытьЗадачу", "Видимость", Ложь);
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаРеанимировать", "Видимость", Истина); 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаКомандыЗадачи", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийКоманднаяПанель", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПланЗадачи", "ТолькоПросмотр", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаПрикрепитьРеализации", "Видимость", Истина);
	КонецЕсли;
#КонецОбласти

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПредСогласованныеЧасы", "Видимость",
		Не Объект.ТипОценкиЗадачи = Перечисления.ЦБР_ТипОценкиЗадачи.ПоФакту);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодвалПредСогласованныеЧасы", "Видимость",
		Объект.ТипОценкиЗадачи = Перечисления.ЦБР_ТипОценкиЗадачи.Предсогласованные);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодвалОценка", "Видимость",
		Не Объект.ТипОценкиЗадачи = Перечисления.ЦБР_ТипОценкиЗадачи.Предсогласованные);
		
	Если Стартовала ИЛИ яПостановщик ИЛИ яРуководительПостановщика ИЛИ яНаблюдатель ИЛИ яИсполнитель Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПервая", "Видимость", Ложь);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПервая", "Видимость", Истина);
	КонецЕсли;
	
	Если яИсполнитель ИЛИ яКуратор ИЛИ яРуководительИсполнителя Тогда  
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаДобавитьСобытиеПоЗадаче", "Видимость", ЕстьУточнениеТребований(Объект.Ссылка));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаУдалитьИсполнителя", "Видимость", ЕстьИсполнителивЗадаче(Объект.Ссылка));	
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаДобавитьСобытиеПоЗадаче", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаУдалитьИсполнителя", "Видимость", Ложь);
	КонецЕсли;	
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийОтображатьУдаленные", "Видимость", ЕстьУдаленныеЭтапы(Объект.Ссылка));
		
	УстановитьВидимостьБлокаУтчненияИнформации(Объект,Элементы);

КонецПроцедуры

Процедура УстановитьВидимостьФормыСогласования(ЭтотОбъект) Экспорт
	
	//@skip-check module-self-reference
	Элементы 	= ЭтотОбъект.Элементы; 
	
	Если ЭтотОбъект.ИмяФормы <> "Обработка.ЦБР_АРМКоммерческийКонструктор.Форма.Форма" Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаЗадач", "Видимость",  НЕ ЭтотОбъект.ОткрытаИзЗадачи);
	КонецЕсли;
	
	Если ЭтотОбъект.СогласованиеОценки Тогда

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СогласованиеЗаданийОценкаПредставление",
		"Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СогласованиеЗаданийДатаНачалоПлан",
		"Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СогласованиеЗаданийВремяНачалаПлан",
		"Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СогласованиеЗаданийДлительностьПлан",
		"Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СогласованиеЗаданийДатаОкончаниеПлан",
		"Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СогласованиеЗаданийВремяОкончанияПлан",
		"Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СогласованиеЗаданийСогласоватьСроки",
		"Видимость", ЭтотОбъект.КонтролироватьСроки);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СогласованиеЗаданийВидЧаса",
		"Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СогласованиеЗаданийНетГарантии",
		"Видимость", Истина);
		
	ИначеЕсли ЭтотОбъект.СогласованиеСроков Тогда
		 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СогласованиеЗаданийОценкаПредставление",
		"Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СогласованиеЗаданийДатаНачалоПлан",
		"Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СогласованиеЗаданийВремяНачалаПлан",
		"Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СогласованиеЗаданийДлительностьПлан",
		"Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СогласованиеЗаданийДатаОкончаниеПлан",
		"Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СогласованиеЗаданийВремяОкончанияПлан",
		"Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СогласованиеЗаданийСогласоватьСроки",
		"Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СогласованиеЗаданийВидЧаса",
		"Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СогласованиеЗаданийНетГарантии",
		"Видимость", Ложь);
		
	КонецЕсли;	
	 
КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьРолиВЗадачиУТекущегоПользователя(Объект, Пользователь)
	
	МассивРолей = Новый Массив;
	
	НайденаяСтрока = Объект.Команда.НайтиСтроки(Новый Структура("Исполнитель", Пользователь));
	Если НайденаяСтрока.Количество() Тогда
		Для Каждого Строка Из НайденаяСтрока Цикл
			МассивРолей.Добавить(Строка.Роль);
		КонецЦикла;
		Возврат МассивРолей;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ЕстьУточнениеТребований(СсылкаНаЗадачу)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦБР_Задание.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЦБР_Задание КАК ЦБР_Задание
	|ГДЕ
	|	ЦБР_Задание.Исполнитель = &Исполнитель
	|	И ЦБР_Задание.СсылкаНаЗадачу = &Задача";
	
	Запрос.УстановитьПараметр("Задача", СсылкаНаЗадачу);
	Запрос.УстановитьПараметр("Исполнитель", Пользователи.ТекущийПользователь());
	
	Возврат Запрос.Выполнить().Пустой();	
	
КонецФункции

Функция ЕстьИсполнителивЗадаче(СсылкаНаЗадачу)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦБР_ЗадачаКоманда.Исполнитель КАК Исполнитель
		|ИЗ
		|	Справочник.ЦБР_Задача.Команда КАК ЦБР_ЗадачаКоманда
		|ГДЕ
		|	(ЦБР_ЗадачаКоманда.Роль = ЗНАЧЕНИЕ(Перечисление.ЦБР_РольВЗадаче.Исполнитель)
		|			ИЛИ ЦБР_ЗадачаКоманда.Роль = ЗНАЧЕНИЕ(Перечисление.ЦБР_РольВЗадаче.ИсполнительАналитик)
		|			ИЛИ ЦБР_ЗадачаКоманда.Роль = ЗНАЧЕНИЕ(Перечисление.ЦБР_РольВЗадаче.ИсполнительРазработчик))
		|	И ЦБР_ЗадачаКоманда.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Исполнитель", Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаЗадачу);
	Возврат НЕ Запрос.Выполнить().Пустой();
КонецФункции

Функция ЕстьУдаленныеЭтапы(СсылкаНаЗадачу)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦБР_СтруктураЗадач.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЦБР_СтруктураЗадач КАК ЦБР_СтруктураЗадач
		|ГДЕ
		|	ЦБР_СтруктураЗадач.Владелец = &СсылкаНаЗадачу
		|	И ЦБР_СтруктураЗадач.ПометкаУдаления = ИСТИНА";
	
	Запрос.УстановитьПараметр("СсылкаНаЗадачу", СсылкаНаЗадачу);
	Возврат Не Запрос.Выполнить().Пустой();
КонецФункции
	
Процедура УстановитьВидимостьБлокаУтчненияИнформации(Объект,Элементы)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.Заявитель,
	|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.Ответчик,
	|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.Отменено,
	|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.ДатаОтветаНаЗапросФакт
	|ИЗ
	|	РегистрСведений.ЦБР_УточненияПоЗадачамЗаданиям.СрезПоследних(, Задание = &Задание
	|	И НЕ Отменено) КАК ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних";
	
	Запрос.УстановитьПараметр("Задание", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Если Пользователи.ТекущийПользователь() = Выборка.Ответчик Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормакомандаОтменитьЗапросИнформации", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормакомандаЗапросИнформации", "Видимость", Ложь);
			Если Не ЗначениеЗаполнено(Выборка.ДатаОтветаНаЗапросФакт) Тогда					
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаРегистрСведенийЦБР_УточненияПоЗадачамЗаданиямОткрытьЧат", "Картинка", БиблиотекаКартинок.CRM_Оповещения_1);													
			КонецЕсли;
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаРегистрСведенийЦБР_УточненияПоЗадачамЗаданиямОткрытьЧат", "Фигура",ФигураКнопки.Авто);																	
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормакомандаОтменитьЗапросИнформации", "Видимость", НЕ ЗначениеЗаполнено(Выборка.ДатаОтветаНаЗапросФакт));												
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормакомандаЗапросИнформации", "Видимость", ЗначениеЗаполнено(Выборка.ДатаОтветаНаЗапросФакт));								
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаПеревестиЗадачу", "Видимость", ЗначениеЗаполнено(Выборка.ДатаОтветаНаЗапросФакт));									
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормакомандаОтменитьЗапросИнформации", "Видимость", Ложь);	
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаРегистрСведенийЦБР_УточненияПоЗадачамЗаданиямОткрытьЧат", "Видимость", Ложь);	
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормакомандаЗапросИнформации", "Видимость", Пользователи.ТекущийПользователь() <> Объект.Постановщик);			
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормакомандаЗапросИнформации", "Фигура", ФигураКнопки.Авто);			
	КонецЕсли;

КонецПроцедуры
#КонецОбласти
